# Используем официальный образ Golang в качестве базового образа
FROM golang:1.18-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл go.mod для установки зависимостей
COPY go.mod ./

# Загружаем зависимости
RUN go mod download

# Копируем остальные файлы проекта
COPY . .

# Компилируем наше приложение
RUN go build -o main .

# Сообщаем Docker, что контейнер слушает на порту 8080
EXPOSE 8080

# Команда для запуска нашего приложения
CMD ["./main"]
